src/structs/load_test.yml
config:
  target: 'ws://localhost:8080/ws'  # Убедитесь, что здесь правильный URL вашего WebSocket сервера
  phases:
    - duration: 60  # Продолжительность фазы нагрузки
      arrivalRate: 1  # Количество новых подключений в секунду
  connections: 1  # Количество одновременных подключений

scenarios:
  - name: 'Авторизация с фиксацией пользователя'
    flow:
      - send:
          json: {
            "name": "Tea", 
            "password": "thr",  # Пароль для авторизации
            "is_register": false  # Флаг для авторизации
          }  # Авторизация с заданными данными
      - think: 1  # Задержка перед отправкой сообщения
       # Пауза перед завершением
      - close: {}  # Закрытие соединения